ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_LPC546XX/drivers/fsl_clock.c
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/* Find encoded NDEC value for raw N value, max N = NVALMAX */
static uint32_t pllEncodeN(uint32_t N);
/* Find decoded N value for raw NDEC value */
static uint32_t pllDecodeN(uint32_t NDEC);
/* Find encoded PDEC value for raw P value, max P = PVALMAX */
static uint32_t pllEncodeP(uint32_t P);
/* Find decoded P value for raw PDEC value */
static uint32_t pllDecodeP(uint32_t PDEC);
/* Find encoded MDEC value for raw M value, max M = MVALMAX */
static uint32_t pllEncodeM(uint32_t M);
/* Find decoded M value for raw MDEC value */
static uint32_t pllDecodeM(uint32_t MDEC);
/* Find SELP, SELI, and SELR values for raw M value, max M = MVALMAX */
static void pllFindSel(uint32_t M, uint32_t *pSelP, uint32_t *pSelI, uint32_t *pSelR);
/* Get predivider (N) from PLL NDEC setting */
static uint32_t findPllPreDiv(uint32_t ctrlReg, uint32_t nDecReg);
/* Get postdivider (P) from PLL PDEC setting */
static uint32_t findPllPostDiv(uint32_t ctrlReg, uint32_t pDecReg);
/* Get multiplier (M) from PLL MDEC and BYPASS_FBDIV2 settings */
static uint32_t findPllMMult(uint32_t ctrlReg, uint32_t mDecReg);
/* Get the greatest common divisor */
static uint32_t FindGreatestCommonDivisor(uint32_t m, uint32_t n);
/* Set PLL output based on desired output rate */
static pll_error_t CLOCK_GetPllConfig(
    uint32_t finHz, uint32_t foutHz, pll_setup_t *pSetup);

/* Update local PLL rate variable */
static void CLOCK_GetSystemPLLOutFromSetupUpdate(pll_setup_t *pSetup);
static void CLOCK_GetAudioPLLOutFromSetupUpdate(pll_setup_t *pSetup);

static const uint8_t wdtFreqLookup[32] = {0, 8, 12, 15, 18, 20, 24, 26, 28, 30, 32, 34, 36, 38, 40, 41, 42, 44, 45, 46,
                                          48, 49, 50, 52, 53, 54, 56, 57, 58, 59, 60, 61
                                         };
/*******************************************************************************
 * Code
 ******************************************************************************/

/* Clock Selection for IP */
void CLOCK_AttachClk(clock_attach_id_t connection)
{
    bool final_descriptor = false;
    uint8_t mux;
    uint8_t pos;
    uint32_t i;
    volatile uint32_t *pClkSel;

    pClkSel = &(SYSCON->MAINCLKSELA);

    for (i = 0U; (i <= 2U) && (!final_descriptor); i++) {
        connection = (clock_attach_id_t)(connection >> (i * 12U)); /*!<  pick up next descriptor */
        mux = (uint8_t)connection;
        if (connection) {
            pos = ((connection & 0xf00U) >> 8U) - 1U;
            if (mux == CM_ASYNCAPB) {
                SYSCON->ASYNCAPBCTRL = SYSCON_ASYNCAPBCTRL_ENABLE(1);
                ASYNC_SYSCON->ASYNCAPBCLKSELA = pos;
            } else {
                pClkSel[mux] = pos;
            }
        } else {
            final_descriptor = true;
        }
    }
}

/* Set IP Clock Divider */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divided_by_value, bool reset)
{
    volatile uint32_t *pClkDiv;

    pClkDiv = &(SYSCON->SYSTICKCLKDIV);
    if (reset) {
        pClkDiv[div_name] = 1U << 29U;
    }
    if (divided_by_value == 0U) { /*!<  halt */
        pClkDiv[div_name] = 1U << 30U;
    } else {
        pClkDiv[div_name] = (divided_by_value - 1U);
    }
}

/* Set FRO Clocking */
status_t CLOCK_SetupFROClocking(uint32_t iFreq)
{
    uint32_t usb_adj;
    if ((iFreq != 12000000U) && (iFreq != 48000000U) && (iFreq != 96000000U)) {
        return kStatus_Fail;
    }
    /* Power up the FRO and set this as the base clock */
    POWER_DisablePD(kPDRUNCFG_PD_FRO_EN);
    /* back up the value of whether USB adj is selected, in which case we will have a value of 1 else 0 */
    usb_adj = ((SYSCON->FROCTRL) & SYSCON_FROCTRL_USBCLKADJ_MASK) >> SYSCON_FROCTRL_USBCLKADJ_SHIFT;
    if (iFreq > 12000000U) {
        if (iFreq == 96000000U) {
            SYSCON->FROCTRL = ((SYSCON_FROCTRL_TRIM_MASK | SYSCON_FROCTRL_FREQTRIM_MASK) & *INDEX_SECTOR_TRIM96) |
                              SYSCON_FROCTRL_SEL(1) | SYSCON_FROCTRL_WRTRIM(1) | SYSCON_FROCTRL_USBCLKADJ(usb_adj) |
                              SYSCON_FROCTRL_HSPDCLK(1);
        } else {
            SYSCON->FROCTRL = ((SYSCON_FROCTRL_TRIM_MASK | SYSCON_FROCTRL_FREQTRIM_MASK) & *INDEX_SECTOR_TRIM48) |
                              SYSCON_FROCTRL_SEL(0) | SYSCON_FROCTRL_WRTRIM(1) | SYSCON_FROCTRL_USBCLKADJ(usb_adj) |
                              SYSCON_FROCTRL_HSPDCLK(1);
        }
    } else {
        SYSCON->FROCTRL &= ~SYSCON_FROCTRL_HSPDCLK(1);
    }

    return 0U;
}

/* Get CLOCK OUT Clk */
uint32_t CLOCK_GetClockOutClkFreq(void)
{
    return (SYSCON->CLKOUTSELA == 0U) ? CLOCK_GetCoreSysClkFreq() :
           (SYSCON->CLKOUTSELA == 1U) ? CLOCK_GetExtClkFreq() :
           (SYSCON->CLKOUTSELA == 2U) ? CLOCK_GetWdtOscFreq() :
           (SYSCON->CLKOUTSELA == 3U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->CLKOUTSELA == 4U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->CLKOUTSELA == 5U) ? CLOCK_GetUsbPllOutFreq() :
           (SYSCON->CLKOUTSELA == 6U) ? CLOCK_GetAudioPllOutFreq() :
           (SYSCON->CLKOUTSELA == 7U) ? CLOCK_GetOsc32KFreq() : 0U;
}

/* Get SPIFI Clk */
uint32_t CLOCK_GetSpifiClkFreq(void)
{
    return (SYSCON->SPIFICLKSEL == 0U) ? CLOCK_GetCoreSysClkFreq() :
           (SYSCON->SPIFICLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->SPIFICLKSEL == 2U) ? CLOCK_GetUsbPllOutFreq() :
           (SYSCON->SPIFICLKSEL == 3U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->SPIFICLKSEL == 4U) ? CLOCK_GetAudioPllOutFreq() :
           (SYSCON->SPIFICLKSEL == 7U) ? 0U : 0U;
}

/* Get ADC Clk */
uint32_t CLOCK_GetAdcClkFreq(void)
{
    return (SYSCON->ADCCLKSEL == 0U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->ADCCLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->ADCCLKSEL == 2U) ? CLOCK_GetUsbPllOutFreq() :
           (SYSCON->ADCCLKSEL == 3U) ? CLOCK_GetAudioPllOutFreq() :
           (SYSCON->ADCCLKSEL == 7U) ? 0U : 0U;
}

/* Get USB0 Clk */
uint32_t CLOCK_GetUsb0ClkFreq(void)
{
    return (SYSCON->USB0CLKSEL == 0U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->USB0CLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->USB0CLKSEL == 2U) ? CLOCK_GetUsbPllOutFreq() :
           (SYSCON->USB0CLKSEL == 7U) ? 0U : 0U;
}

