ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_LPC546XX/drivers/fsl_clock.c
/* Get USB1 Clk */
uint32_t CLOCK_GetUsb1ClkFreq(void)
{

    return (SYSCON->USB1CLKSEL == 0U) ? CLOCK_GetCoreSysClkFreq() :
           (SYSCON->USB1CLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->USB1CLKSEL == 2U) ? CLOCK_GetUsbPllOutFreq() :
           (SYSCON->USB1CLKSEL == 7U) ? 0U : 0U;
}

/* Get MCLK Clk */
uint32_t CLOCK_GetMclkClkFreq(void)
{
    return (SYSCON->MCLKCLKSEL == 0U) ? CLOCK_GetFroHfFreq() / ((SYSCON->FROHFCLKDIV & 0xffu) + 1U) :
           (SYSCON->MCLKCLKSEL == 1U) ? CLOCK_GetAudioPllOutFreq() :
           (SYSCON->MCLKCLKSEL == 7U) ? 0U : 0U;
}

/* Get SCTIMER Clk */
uint32_t CLOCK_GetSctClkFreq(void)
{
    return (SYSCON->SCTCLKSEL == 0U) ? CLOCK_GetCoreSysClkFreq() :
           (SYSCON->SCTCLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->SCTCLKSEL == 2U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->SCTCLKSEL == 3U) ? CLOCK_GetAudioPllOutFreq() :
           (SYSCON->SCTCLKSEL == 7U) ? 0U : 0U;
}

/* Get SDIO Clk */
uint32_t CLOCK_GetSdioClkFreq(void)
{
    return (SYSCON->SDIOCLKSEL == 0U) ? CLOCK_GetCoreSysClkFreq() :
           (SYSCON->SDIOCLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->SDIOCLKSEL == 2U) ? CLOCK_GetUsbPllOutFreq() :
           (SYSCON->SDIOCLKSEL == 3U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->SDIOCLKSEL == 4U) ? CLOCK_GetAudioPllOutFreq() :
           (SYSCON->SDIOCLKSEL == 7U) ? 0U : 0U;
}

/* Get LCD Clk */
uint32_t CLOCK_GetLcdClkFreq(void)
{
    return (SYSCON->LCDCLKSEL == 0U) ? CLOCK_GetCoreSysClkFreq() :
           (SYSCON->LCDCLKSEL == 1U) ? CLOCK_GetLcdClkIn() :
           (SYSCON->LCDCLKSEL == 2U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->LCDCLKSEL == 3U) ? 0U : 0U;
}

/* Get LCD CLK IN Clk */
uint32_t CLOCK_GetLcdClkIn(void)
{
    return g_Lcd_Clk_In_Freq;
}

/* Get FRO 12M Clk */
uint32_t CLOCK_GetFro12MFreq(void)
{
    return (SYSCON->PDRUNCFG[0] & SYSCON_PDRUNCFG_PDEN_FRO_MASK) ? 0U : 12000000U;
}

/* Get EXT OSC Clk */
uint32_t CLOCK_GetExtClkFreq(void)
{
    return g_Ext_Clk_Freq;
}

/* Get WATCH DOG Clk */
uint32_t CLOCK_GetWdtOscFreq(void)
{
    uint8_t freq_sel, div_sel;
    if (SYSCON->PDRUNCFG[0] & SYSCON_PDRUNCFG_PDEN_WDT_OSC_MASK) {
        return 0U;
    } else {
        div_sel = ((SYSCON->WDTOSCCTRL & 0x1f) + 1) << 1;
        freq_sel = wdtFreqLookup[((SYSCON->WDTOSCCTRL & SYSCON_WDTOSCCTRL_FREQSEL_MASK) >> SYSCON_WDTOSCCTRL_FREQSEL_SHIFT)];
        return ((uint32_t) freq_sel * 50000U) / ((uint32_t)div_sel);
    }
}

/* Get HF FRO Clk */
uint32_t CLOCK_GetFroHfFreq(void)
{
    return (SYSCON->PDRUNCFG[0] & SYSCON_PDRUNCFG_PDEN_FRO_MASK) ? 0 :
           !(SYSCON->FROCTRL & SYSCON_FROCTRL_HSPDCLK_MASK) ? 0 :
           (SYSCON->FROCTRL & SYSCON_FROCTRL_SEL_MASK) ? 96000000U : 48000000U;
}

/* Get SYSTEM PLL Clk */
uint32_t CLOCK_GetPllOutFreq(void)
{
    return s_Pll_Freq;
}

/* Get AUDIO PLL Clk */
uint32_t CLOCK_GetAudioPllOutFreq(void)
{
    return s_Audio_Pll_Freq;
}

/* Get USB PLL Clk */
uint32_t CLOCK_GetUsbPllOutFreq(void)
{
    return s_Usb_Pll_Freq;
}

/* Get RTC OSC Clk */
uint32_t CLOCK_GetOsc32KFreq(void)
{
    return CLK_RTC_32K_CLK;               /* Needs to be corrected to check that RTC Clock is enabled */
}

/* Get MAIN Clk */
uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    return ((SYSCON->MAINCLKSELB == 0U) && (SYSCON->MAINCLKSELA == 0U)) ? CLOCK_GetFro12MFreq() :
           ((SYSCON->MAINCLKSELB == 0U) && (SYSCON->MAINCLKSELA == 1U)) ? CLOCK_GetExtClkFreq() :
           ((SYSCON->MAINCLKSELB == 0U) && (SYSCON->MAINCLKSELA == 2U)) ? CLOCK_GetWdtOscFreq() :
           ((SYSCON->MAINCLKSELB == 0U) && (SYSCON->MAINCLKSELA == 3U)) ? CLOCK_GetFroHfFreq() :
           (SYSCON->MAINCLKSELB == 2U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->MAINCLKSELB == 3U) ? CLOCK_GetOsc32KFreq() : 0U;
}

/* Get I2S MCLK Clk */
uint32_t CLOCK_GetI2SMClkFreq(void)
{
    return g_I2S_Mclk_Freq;
}

/* Get ASYNC APB Clk */
uint32_t CLOCK_GetAsyncApbClkFreq(void)
{
    async_clock_src_t clkSrc;
    uint32_t clkRate;

    clkSrc = CLOCK_GetAsyncApbClkSrc();

    switch (clkSrc) {
        case kCLOCK_AsyncMainClk:
            clkRate = CLOCK_GetCoreSysClkFreq();
            break;
        case kCLOCK_AsyncFro12Mhz:
            clkRate = CLK_FRO_12MHZ;
            break;
        default:
            clkRate = 0U;
            break;
    }

    return clkRate;
}

/* Get FLEXCOMM Clk */
uint32_t CLOCK_GetFlexCommClkFreq(uint32_t id)
{
    return (SYSCON->FCLKSEL[id] == 0U) ? CLOCK_GetFro12MFreq() :
           (SYSCON->FCLKSEL[id] == 1U) ? CLOCK_GetFroHfFreq() :
           (SYSCON->FCLKSEL[id] == 2U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->FCLKSEL[id] == 3U) ? CLOCK_GetI2SMClkFreq() :
           (SYSCON->FCLKSEL[id] == 4U) ? CLOCK_GetFreq(kCLOCK_Frg) : 0U;
}

/* Get FRG Clk */
uint32_t CLOCK_GetFRGInputClock(void)
{
    return (SYSCON->FRGCLKSEL == 0U) ? CLOCK_GetCoreSysClkFreq() :
           (SYSCON->FRGCLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
           (SYSCON->FRGCLKSEL == 2U) ? CLOCK_GetFro12MFreq() :
           (SYSCON->FRGCLKSEL == 3U) ? CLOCK_GetFroHfFreq() : 0U;
}

/* Set FRG Clk */
uint32_t CLOCK_SetFRGClock(uint32_t freq)
{
    uint32_t input = CLOCK_GetFRGInputClock();
    uint32_t mul;

    if ((freq > 48000000) || (freq > input) || (input / freq >= 2)) {
        /* FRG output frequency should be less than equal to 48MHz */
        return 0;
    } else {
        mul = ((uint64_t)(input - freq) * 256) / ((uint64_t)freq);
        SYSCON->FRGCTRL = (mul << SYSCON_FRGCTRL_MULT_SHIFT) | SYSCON_FRGCTRL_DIV_MASK;
        return 1;
    }
}

/* Set IP Clk */
uint32_t CLOCK_GetFreq(clock_name_t clockName)
{
    uint32_t freq;
    switch (clockName) {
        case kCLOCK_CoreSysClk:
            freq = CLOCK_GetCoreSysClkFreq();
            break;
        case kCLOCK_BusClk:
            freq = CLOCK_GetCoreSysClkFreq() / ((SYSCON->AHBCLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_ClockOut:
            freq = CLOCK_GetClockOutClkFreq() / ((SYSCON->CLKOUTDIV & 0xffU) + 1U);
            break;
        case kCLOCK_SpiFi:
            freq = CLOCK_GetSpifiClkFreq() / ((SYSCON->SPIFICLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_Adc:
            freq = CLOCK_GetAdcClkFreq() / ((SYSCON->ADCCLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_Usb0:
            freq = CLOCK_GetUsb0ClkFreq() / ((SYSCON->USB0CLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_Usb1:
            freq = CLOCK_GetUsb1ClkFreq() / ((SYSCON->USB1CLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_Mclk:
            freq = CLOCK_GetMclkClkFreq() / ((SYSCON->MCLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_FroHf:
            freq = CLOCK_GetFroHfFreq();
            break;
        case kCLOCK_Fro12M:
            freq = CLOCK_GetFro12MFreq();
            break;
        case kCLOCK_ExtClk:
            freq = CLOCK_GetExtClkFreq();
            break;
        case kCLOCK_PllOut:
            freq = CLOCK_GetPllOutFreq();
            break;
        case kClock_WdtOsc:
            freq = CLOCK_GetWdtOscFreq();
            break;
        case kCLOCK_Frg:
            freq = (SYSCON->FRGCLKSEL == 0U) ? CLOCK_GetCoreSysClkFreq() :
                   (SYSCON->FRGCLKSEL == 1U) ? CLOCK_GetPllOutFreq() :
                   (SYSCON->FRGCLKSEL == 2U) ? CLOCK_GetFro12MFreq() :
                   (SYSCON->FRGCLKSEL == 3U) ? CLOCK_GetFroHfFreq() : 0U;
            break;
        case kCLOCK_Dmic:
            freq = (SYSCON->DMICCLKSEL == 0U) ? CLOCK_GetFro12MFreq() :
                   (SYSCON->DMICCLKSEL == 1U) ? CLOCK_GetFroHfFreq() :
                   (SYSCON->DMICCLKSEL == 2U) ? CLOCK_GetPllOutFreq() :
                   (SYSCON->DMICCLKSEL == 3U) ? CLOCK_GetI2SMClkFreq() :
                   (SYSCON->DMICCLKSEL == 4U) ? CLOCK_GetCoreSysClkFreq() :
                   (SYSCON->DMICCLKSEL == 5U) ? CLOCK_GetWdtOscFreq() : 0U;
            freq = freq / ((SYSCON->DMICCLKDIV & 0xffU) + 1U);
            break;

        case kCLOCK_AsyncApbClk:
            freq = CLOCK_GetAsyncApbClkFreq();
            break;
        case kCLOCK_Sct:
            freq = CLOCK_GetSctClkFreq() / ((SYSCON->SCTCLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_SDio:
            freq = CLOCK_GetSdioClkFreq() / ((SYSCON->SDIOCLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_EMC:
            freq = CLOCK_GetCoreSysClkFreq() / ((SYSCON->AHBCLKDIV & 0xffU) + 1U) / ((SYSCON->EMCCLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_LCD:
            freq = CLOCK_GetLcdClkFreq() / ((SYSCON->LCDCLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_MCAN0:
            freq = CLOCK_GetCoreSysClkFreq() / ((SYSCON->CAN0CLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_MCAN1:
            freq = CLOCK_GetCoreSysClkFreq() / ((SYSCON->CAN1CLKDIV & 0xffU) + 1U);
            break;
        case kCLOCK_FlexI2S:
            freq = CLOCK_GetI2SMClkFreq();
            break;
        case kCLOCK_Flexcomm0:
            freq = CLOCK_GetFlexCommClkFreq(0U);
            break;
        case kCLOCK_Flexcomm1:
            freq = CLOCK_GetFlexCommClkFreq(1U);
            break;
        case kCLOCK_Flexcomm2:
            freq = CLOCK_GetFlexCommClkFreq(2U);
            break;
        case kCLOCK_Flexcomm3:
            freq = CLOCK_GetFlexCommClkFreq(3U);
            break;
        case kCLOCK_Flexcomm4:
            freq = CLOCK_GetFlexCommClkFreq(4U);
            break;
        case kCLOCK_Flexcomm5:
            freq = CLOCK_GetFlexCommClkFreq(5U);
            break;
        case kCLOCK_Flexcomm6:
            freq = CLOCK_GetFlexCommClkFreq(6U);
            break;
        case kCLOCK_Flexcomm7:
            freq = CLOCK_GetFlexCommClkFreq(7U);
            break;
        case kCLOCK_Flexcomm8:
            freq = CLOCK_GetFlexCommClkFreq(8U);
            break;
        case kCLOCK_Flexcomm9:
            freq = CLOCK_GetFlexCommClkFreq(9U);
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/* Set the FLASH wait states for the passed frequency */
void CLOCK_SetFLASHAccessCyclesForFreq(uint32_t iFreq)
{
    if (iFreq <= 12000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash1Cycle);
    } else if (iFreq <= 24000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash2Cycle);
    } else if (iFreq <= 36000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash3Cycle);
    } else if (iFreq <= 60000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash4Cycle);
    } else if (iFreq <= 96000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash5Cycle);
    } else if (iFreq <= 120000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash6Cycle);
    } else if (iFreq <= 144000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash7Cycle);
    } else if (iFreq <= 168000000U) {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash8Cycle);
    } else {
        CLOCK_SetFLASHAccessCycles(kCLOCK_Flash9Cycle);
    }
}

